In [216]:
import pandas as pd
import numpy as np

Chapter 5 - Getting Started with Pandas

In [217]:
from pandas import DataFrame, Series

# 5.1 Introduction to pandas Data Structures

### Series

In [218]:
obj = pd.Series([4, 7, -5, 3])

In [219]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

And so on...

In [220]:
obj.values

array([ 4,  7, -5,  3])

In [221]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [222]:
obj2 = pd.Series([4,7,-5,4], index = ['a','b','d','c'])

In [223]:
obj2

a    4
b    7
d   -5
c    4
dtype: int64

In [224]:
obj2.index

Index(['a', 'b', 'd', 'c'], dtype='object')

In [225]:
obj2['a']

4

In [226]:
obj2['c']

4

In [227]:
obj2[['b','a','c']]

b    7
a    4
c    4
dtype: int64

In [228]:
obj2[obj2>0]

a    4
b    7
c    4
dtype: int64

In [229]:
obj2*2

a     8
b    14
d   -10
c     8
dtype: int64

In [230]:
np.exp(obj2)

a      54.598150
b    1096.633158
d       0.006738
c      54.598150
dtype: float64

In [231]:
'g' in obj2

False

In [232]:
'a' in obj2

True

In [233]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000, 'Utah':5000}

In [234]:
obj3=pd.Series(sdata)

In [235]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [236]:
states=['California','Ohio','Oregon','Texas']

In [237]:
obj4=pd.Series(sdata, index=states)

In [238]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [239]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [240]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [241]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [242]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [243]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [244]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [245]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [246]:
obj4.name='population'

In [247]:
obj4.index.name='state'

In [248]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [249]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [250]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [251]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [252]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'], 'year':[2000,2001,2002,2001,2002,2003], 'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [253]:
frame=pd.DataFrame(data)

In [254]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [255]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [256]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [257]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])

In [258]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [259]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [260]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [261]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [262]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [263]:
frame2['debt']=16.5

In [264]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [265]:
frame2['debt']=np.arange(6.)

In [266]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [267]:
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [268]:
frame2['debt']=val

In [269]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [270]:
frame2['eastern'] = frame2.state=='Ohio'

In [271]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [272]:
del frame2['eastern']

In [273]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [274]:
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [275]:
frame3=pd.DataFrame(pop)

In [276]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [277]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [278]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [279]:
pdata={'Ohio':frame3['Ohio'][:-1], 'Nevada':frame3['Nevada'][:2]}

In [280]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [281]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [282]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [283]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [284]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Index Objects

In [285]:
obj= pd.Series(range(3), index = ['a','b','c'])

In [286]:
index = obj.index

In [287]:
index

Index(['a', 'b', 'c'], dtype='object')

In [288]:
index[1:]

Index(['b', 'c'], dtype='object')

In [289]:
index[1]='d'

TypeError: Index does not support mutable operations

In [290]:
labels = pd.Index(np.arange(3))

In [291]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [292]:
obj2 =pd.Series([1.5,-2.5,0],index=labels)

In [293]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [294]:
obj2.index is labels

True

In [295]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [296]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [298]:
'Ohio' in frame3.columns

True

In [299]:
2003 in frame3.index

False

In [300]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [301]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 5.2 Essential Functionality

### Reindexing

In [302]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c'])

In [303]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [304]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [305]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [306]:
obj3 = pd.Series(['blue','purple','yellow'], index = [0,2,4])

In [307]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [308]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [309]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [310]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [311]:
frame2 = frame.reindex(['a','b','c','d'])

In [312]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [313]:
states = ['Texas','Utah','California']

In [314]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [315]:
frame.dtypes

Ohio          int64
Texas         int64
California    int64
dtype: object

In [316]:
frame.loc[['a','b','c','d'], states]

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['b'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

KeyError: "Passing list-likes to .loc or [] with any missing labels is no longer supported. The following labels were missing: Index(['b'], dtype='object'). See https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike"

## So moving on...

### Dropping Entries from an Axis

In [317]:
obj = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])

In [318]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [319]:
new_obj = obj.drop('c')

In [320]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [321]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [322]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index=['Ohio','Colorado','Utah','New York'], columns=['one', 'two', 'three', 'four'])

In [323]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [324]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [326]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [327]:
data.drop(['two','four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [328]:
obj.drop('c', inplace = True)

In [329]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### Indexing, Selection and Filtering

In [330]:
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])

In [331]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [332]:
obj['b']

1.0

In [333]:
obj[1]

1.0

In [334]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [336]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [337]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [338]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [339]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [340]:
obj['b':'c'] = 5

In [341]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [343]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'], columns = ['one','two','three','four'])

In [345]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [346]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [349]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [350]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [351]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [352]:
data <5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [353]:
data[data<5] = 0

In [354]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc

In [355]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [356]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [357]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [358]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [359]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [361]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Integer Indexes

In [362]:
ser = pd.Series(np.arange(3.))

In [363]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [366]:
ser[-1]

KeyError: -1

In [367]:
ser2=pd.Series(np.arange(3.), index=['a','b','c'])

In [368]:
ser2[-1]

2.0

In [370]:
ser[:1]

0    0.0
dtype: float64

In [372]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [373]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [375]:
s1=pd.Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])

In [376]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [377]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [378]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [379]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [382]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'), index=['Ohio','Texas','Colorado'])

In [383]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'), index = ['Utah','Ohio','Texas','Oregon'])

In [384]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [385]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [386]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [387]:
df1 = pd.DataFrame({'A':[1,2]})

In [388]:
df2 = pd.DataFrame({'B':[3,4]})

In [389]:
df1

   A
0  1
1  2

In [390]:
df2

   B
0  3
1  4

In [391]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Aithmetic methods with fill values

In [392]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns = list('abcd'))

In [393]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))

In [394]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [395]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [396]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [397]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [398]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [399]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [400]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [401]:
arr=np.arange(12.).reshape((3,4))

In [402]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [403]:
arr[0]

array([0., 1., 2., 3.])

In [404]:
arr-arr[0] #broadcasting

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [405]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [406]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [407]:
series = frame.iloc[0]

In [408]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [409]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [410]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [411]:
series2 = pd.Series(range(3), index = ['b','e','f'])

In [412]:
series2

b    0
e    1
f    2
dtype: int64

In [413]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [414]:
series3 = frame['d']

In [415]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [416]:
series3=frame['d']

In [417]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [418]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [419]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [430]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index=['Utah','Ohio','Texas','Oregon'])

In [431]:
frame

               b         d         e
Utah    1.335411  1.707379 -0.174933
Ohio    1.560473  1.513350 -0.685544
Texas   0.569534  0.224741  1.086425
Oregon -1.024699  0.700551  0.826058

In [432]:
np.abs(frame)

               b         d         e
Utah    1.335411  1.707379  0.174933
Ohio    1.560473  1.513350  0.685544
Texas   0.569534  0.224741  1.086425
Oregon  1.024699  0.700551  0.826058

In [423]:
f=lambda x: x.max() - x.min()

In [425]:
frame.apply(f)

b    1.389600
d    2.050440
e    1.219915
dtype: float64

In [426]:
frame.apply(f, axis = 'columns')

Utah      0.348192
Ohio      1.187424
Texas     0.361882
Oregon    1.821172
dtype: float64

In [433]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [434]:
frame.apply(f)

            b         d         e
min -1.024699  0.224741 -0.685544
max  1.560473  1.707379  1.086425

In [435]:
format = lambda x: '%.2f' %x

In [436]:
frame.applymap(format)

            b     d      e
Utah     1.34  1.71  -0.17
Ohio     1.56  1.51  -0.69
Texas    0.57  0.22   1.09
Oregon  -1.02  0.70   0.83

In [437]:
frame['e'].map(format)

Utah      -0.17
Ohio      -0.69
Texas      1.09
Oregon     0.83
Name: e, dtype: object

### Sorting and Ranking

In [438]:
obj = pd.Series(range(4), index = ['d','a','b','c'])

In [439]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [440]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three','one'], columns = ['d','a','b','c'])

In [441]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [442]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [443]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [444]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [445]:
obj = pd.Series ([4,7,-3,2])

In [446]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [448]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [449]:
obj = pd.Series([4,np.nan, 7, np.nan, -3,-2])

In [450]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5   -2.0
dtype: float64

In [451]:
obj.sort_values()

4   -3.0
5   -2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [452]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [453]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [454]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [455]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [456]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [457]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [458]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [460]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [461]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [462]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [463]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [464]:
obj = pd.Series(range(5), index = ['a','a','b','b','c'])

In [465]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [466]:
obj.index.is_unique

False

In [467]:
obj['a']

a    0
a    1
dtype: int64

In [468]:
obj['c']

4

In [469]:
df = pd.DataFrame(np.random.randn(4,3), index = ['a','a','b','b'])

In [470]:
df

          0         1         2
a -0.765910 -0.982990 -0.801824
a -1.295736 -0.431474 -0.200479
b -1.133115 -1.737299 -0.639098
b  0.277291  0.477316 -0.484997

In [471]:
df.loc['b']

          0         1         2
b -1.133115 -1.737299 -0.639098
b  0.277291  0.477316 -0.484997

## 5.3 Summarizing and Computing Descriptive Statistics

In [472]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan, np.nan], [0.75,-1.3]],index=['a','b','c','d'],columns = ['one','two'])

In [473]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [474]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [475]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [476]:
df.mean(axis='columns',skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [477]:
df.idxmax()

one    b
two    d
dtype: object

In [478]:
df.idxmin()

one    d
two    b
dtype: object

In [479]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [480]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [481]:
obj=pd.Series(['a','a','b','c']*4)

In [482]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [483]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [485]:
import pandas_datareader.data as web

In [486]:
all_data = {ticker:web.get_data_yahoo(ticker) for ticker in ['AAPL','IBM','MSFT','GOOG']}

In [488]:
price = pd.DataFrame({ticker:data['Adj Close'] for ticker, data in all_data.items()})

In [489]:
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [490]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2016-11-11   27.217501   26.637501   26.780001   27.107500  136575600.0
 2016-11-14   26.952499   26.020000   26.927500   26.427500  204702000.0
 2016-11-15   26.920000   26.540001   26.642500   26.777500  129058000.0
 2016-11-16   27.557501   26.650000   26.674999   27.497499  235362000.0
 2016-11-17   27.587500   27.207500   27.452499   27.487499  110528000.0
 ...                ...         ...         ...         ...          ...
 2021-11-04  152.429993  150.639999  151.580002  150.960007   60394600.0
 2021-11-05  152.199997  150.059998  151.889999  151.279999   65414600.0
 2021-11-08  151.570007  150.160004  151.410004  150.440002   55020900.0
 2021-11-09  151.429993  150.059998  150.199997  150.809998   56787900.0
 2021-11-10  150.129700  147.850006  150.020004  147.919998   65187092.0

              Adj Close
 Date
 2016-11-11   25.515797
 2016-11-14   24.875725
 2016-11-15   25.205173
 2016-11-16   25.882895
 2016-11-17   25.873486
 ...                ...
 2021-11-04  150.740005
 2021-11-05  151.279999
 2021-11-08  150.440002
 2021-11-09  150.809998
 2021-11-10  147.919998

 [1258 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2016-11-11  154.244736  152.323135  152.934998  154.177826  4651144.0
 2016-11-14  154.741867  150.650101  154.158707  151.252396  5435539.0
 2016-11-15  152.151047  150.621414  151.453156  151.692154  3636942.0
 2016-11-16  152.533463  151.080307  151.491394  152.284897  2356429.0
 2016-11-17  152.896744  151.864243  152.217972  152.772461  2365215.0
 ...                ...         ...         ...         ...        ...
 2021-11-04  123.339996  119.900002  123.050003  120.849998  7208700.0
 2021-11-05  123.769997  121.430000  121.430000  123.610001  6786500.0
 2021-11-08  124.779999  123.529999  123.989998  124.540001  5625300.0
 2021-11-09  122.900002  120.260002  122.559998  120.849998  7236600.0
 2021-11-10  122.430000  119.930000  121.000000  120.220001  6270300.0

              Adj Close
 Date
 2016-11-11  122.579903
 2016-11-14  120.253998
 2016-11-15  120.603683
 2016-11-16  121.074898
 2016-11-17  121.462585
 ...                ...
 2021-11-04  119.258591
 2021-11-05  121.982246
 2021-11-08  122.900002
 2021-11-09  120.849998
 2021-11-10  120.220001

 [1258 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2016-11-11   59.119999   58.009998   58.230000   59.020000  38767800.0
 2016-11-14   59.080002   57.279999   59.020000   58.119999  41328400.0
 2016-11-15   59.490002   58.320000   58.330002   58.869999  35904100.0
 2016-11-16   59.660000   58.810001   58.939999   59.650002  27332500.0
 2016-11-17   60.950001   59.970001   60.410000   60.639999  32132700.0
 ...                ...         ...         ...         ...         ...
 2021-11-04  336.540009  329.510010  332.890015  336.440002  23992200.0
 2021-11-05  338.790009  334.420013  338.510010  336.059998  22564000.0
 2021-11-08  337.649994  334.440002  337.299988  336.989990  20897000.0
 2021-11-09  338.720001  334.529999  337.109985  335.950012  21307400.0
 2021-11-10  334.630310  329.920013  334.570007  330.799988  25500938.0

              Adj Close
 Date
 2016-11-11   54.607002
 2016-11-14   53.774300
 2016-11-15   54.836182
 2016-11-16   55.562737
 2016-11-17   56.484894
 ...                ...
 2021-11-04  336.440002
 2021-11-05  336.059998
 2021-11-08  336.989990
 2021-11-09  335.950012
 2021-11-10  330.799988

 [1258 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2016-11-11   760.780029   750.380005   756.539978   754.020020  2431800
 2016-11-14   757.849976   727.539978   755.599976   736.080017  3654400
 2016-11-15   764.416016   746.969971   746.969971   758.489990  2384000
 2016-11-16   766.359985   750.510010   755.200012   764.479980  1472600
 2016-11-17   772.700012   764.229980   766.919983   771.229980  1304000
 ...                 ...          ...          ...          ...      ...
 2021-11-04  2999.000000  2932.699951  2944.000000  2973.659912  1235000
 2021-11-05  3011.415039  2973.040039  2987.070068  2984.820068  1019700
 2021-11-08  3020.689941  2982.399902  3000.000000  2987.030029   919400
 2021-11-09  3007.570068  2950.139893  2994.919922  2984.969971   843800
 2021-11-10  2970.870117  2906.500000  2960.195068  2932.520020  1135416

               Adj Close
 Date
 2016-11-11   754.020020
 2016-11-14   736.080017
 2016-11-15   758.489990
 2016-11-16   764.479980
 2016-11-17   771.229980
 ...                 ...
 2021-11-04  2973.659912
 2021-11-05  2984.820068
 2021-11-08  2987.030029
 2021-11-09  2984.969971
 2021-11-10  2932.520020

 [1258 rows x 6 columns]}

In [491]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2016-11-11   25.515797  122.579903   54.607002   754.020020
2016-11-14   24.875725  120.253998   53.774300   736.080017
2016-11-15   25.205173  120.603683   54.836182   758.489990
2016-11-16   25.882895  121.074898   55.562737   764.479980
2016-11-17   25.873486  121.462585   56.484894   771.229980
...                ...         ...         ...          ...
2021-11-04  150.740005  119.258591  336.440002  2973.659912
2021-11-05  151.279999  121.982246  336.059998  2984.820068
2021-11-08  150.440002  122.900002  336.989990  2987.030029
2021-11-09  150.809998  120.849998  335.950012  2984.969971
2021-11-10  147.919998  120.220001  330.799988  2932.520020

[1258 rows x 4 columns]

In [492]:
volume

                   AAPL        IBM        MSFT     GOOG
Date
2016-11-11  136575600.0  4651144.0  38767800.0  2431800
2016-11-14  204702000.0  5435539.0  41328400.0  3654400
2016-11-15  129058000.0  3636942.0  35904100.0  2384000
2016-11-16  235362000.0  2356429.0  27332500.0  1472600
2016-11-17  110528000.0  2365215.0  32132700.0  1304000
...                 ...        ...         ...      ...
2021-11-04   60394600.0  7208700.0  23992200.0  1235000
2021-11-05   65414600.0  6786500.0  22564000.0  1019700
2021-11-08   55020900.0  5625300.0  20897000.0   919400
2021-11-09   56787900.0  7236600.0  21307400.0   843800
2021-11-10   65187092.0  6270300.0  25500938.0  1135416

[1258 rows x 4 columns]

In [504]:
returns = price.pct_change()

In [505]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-11-04 -0.003499 -0.005671  0.007305  0.012896
2021-11-05  0.003582  0.022838 -0.001129  0.003753
2021-11-08 -0.005553  0.007524  0.002767  0.000740
2021-11-09  0.002459 -0.016680 -0.003086 -0.000690
2021-11-10 -0.019163 -0.005213 -0.015330 -0.017571

In [506]:
returns

                AAPL       IBM      MSFT      GOOG
Date
2016-11-11       NaN       NaN       NaN       NaN
2016-11-14 -0.025085 -0.018975 -0.015249 -0.023792
2016-11-15  0.013244  0.002908  0.019747  0.030445
2016-11-16  0.026888  0.003907  0.013250  0.007897
2016-11-17 -0.000364  0.003202  0.016597  0.008830
...              ...       ...       ...       ...
2021-11-04 -0.003499 -0.005671  0.007305  0.012896
2021-11-05  0.003582  0.022838 -0.001129  0.003753
2021-11-08 -0.005553  0.007524  0.002767  0.000740
2021-11-09  0.002459 -0.016680 -0.003086 -0.000690
2021-11-10 -0.019163 -0.005213 -0.015330 -0.017571

[1258 rows x 4 columns]

In [507]:
returns['MSFT'].corr(returns['IBM'])

0.5054965235633474

In [508]:
returns['MSFT'].cov(returns['IBM'])

0.0001444426027606046

In [509]:
returns.MSFT.corr(returns.IBM)

0.5054965235633474

In [510]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.438958  0.736373  0.660783
IBM   0.438958  1.000000  0.505497  0.474820
MSFT  0.736373  0.505497  1.000000  0.778334
GOOG  0.660783  0.474820  0.778334  1.000000

In [511]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000362  0.000138  0.000241  0.000213
IBM   0.000138  0.000275  0.000144  0.000134
MSFT  0.000241  0.000144  0.000297  0.000227
GOOG  0.000213  0.000134  0.000227  0.000288

In [512]:
returns.corrwith(volume)

AAPL   -0.071640
IBM    -0.138348
MSFT   -0.062378
GOOG   -0.114437
dtype: float64

In [513]:
returns.corrwith(returns.IBM)

AAPL    0.438958
IBM     1.000000
MSFT    0.505497
GOOG    0.474820
dtype: float64

### Unique Values, Value counts and Membership

In [514]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])

In [515]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [516]:
uniques = obj.unique()

In [517]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [518]:
uniques.sort()

In [519]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [520]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [521]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [522]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [524]:
mask = obj.isin(['b','c'])

In [525]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [526]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [527]:
to_match=pd.Series(['c','a','b','b','c','a'])

In [528]:
unique_vals=pd.Series(['c','b','a'])

In [529]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [532]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4], 'Qu2':[2,3,1,2,3], 'Qu3':[1,5,2,4,4]})

In [533]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [534]:
result = data.apply(pd.value_counts).fillna(0)

In [535]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## ****** Completed Ch 5 ******